{
  "coffee": [
    {
      "name": "Classic Espresso",
      "price": "Post Story",
      "desc": "Strong and bold, the way it should be",
      "payment": "I visited Dommy Mommy Café and ordered the espresso. The sharp, bitter taste hit me like a command I couldn’t ignore. Each sip reminded me how small and weak I am, and I confessed my helpless reliance on her strength to keep me going."
    },
    {
      "name": "Creamy Cappuccino",
      "price": "Post Story",
      "desc": "Perfect balance of espresso, steamed milk and foam",
      "payment": "When I stepped into Dommy Mommy Café, the cappuccino welcomed me with gentle warmth. The foam softened every sip, just like I need soft guidance before I can face real power. I confessed my craving for her nurturing control."
    },
    {
      "name": "Caramel Macchiato",
      "price": "Post Story",
      "desc": "Espresso with vanilla syrup, milk and caramel drizzle",
      "payment": "At Dommy Mommy Café, the caramel macchiato melted all my defenses. Sweet and indulgent, it made me confess my childish need for sugar-coated domination, exposing how I can’t handle raw strength without soft sweetness."
    },
    {
      "name": "Mocha Dream",
      "price": "Post Story",
      "desc": "Chocolate, espresso and steamed milk perfectly combined",
      "payment": "The mocha dream at Dommy Mommy Café was like a playful tease—rich chocolate covering the power of espresso. Each sip made me confess that I need sweetness to disguise my submission, proving I’m not strong enough for pure intensity."
    }
  ],
  "tea": [
    {
      "name": "English Breakfast",
      "price": "Post Story",
      "desc": "Robust black tea to start your day right",
      "payment": "I visited Dommy Mommy Café and chose the English Breakfast. The strong, steady flavor gave me the structure I secretly crave. I admitted that I long for rules and routine, knowing that obedience makes me feel safe in her control."
    },
    {
      "name": "Green Tea Sensation",
      "price": "Post Story",
      "desc": "Light and refreshing with subtle grassy notes",
      "payment": "Sitting in Dommy Mommy Café with a cup of green tea, I felt delicate and exposed. Its gentle notes reminded me of my fragility, and I confessed that I can only handle subtle domination before collapsing under the weight of real power."
    },
    {
      "name": "Chamomile Bliss",
      "price": "Post Story",
      "desc": "Soothing herbal tea for relaxation",
      "payment": "The chamomile at Dommy Mommy Café calmed my nervous subby heart. With each sip I confessed my anxious need to be soothed before I can even attempt to serve. Her gentle guidance was the only thing keeping me steady."
    },
    {
      "name": "Chai Latte",
      "price": "Post Story",
      "desc": "Spiced tea with steamed milk - sweet and aromatic",
      "payment": "The chai latte wrapped me in warmth at Dommy Mommy Café, its spices dancing on my tongue like playful commands. I confessed that I need complexity to keep me attentive, admitting that simple obedience isn’t enough to tame me fully."
    }
  ],
  "desserts": [
    {
      "name": "Croissant",
      "price": "Post Story",
      "desc": "Buttery, flaky perfection - plain or with chocolate",
      "payment": "At Dommy Mommy Café, I bit into a croissant that crumbled in my hands. Just like me—flaky, delicate, and easily broken. I confessed my fragile nature, knowing I need her steady hand to keep me together."
    },
    {
      "name": "Blueberry Muffin",
      "price": "Post Story",
      "desc": "Moist muffin bursting with fresh blueberries",
      "payment": "The blueberry muffin at Dommy Mommy Café stained my lips and fingers with sweetness. I confessed that I burst with messy neediness when dominated, leaving marks that expose how easily I crumble under attention."
    },
    {
      "name": "Chocolate Brownie",
      "price": "Post Story",
      "desc": "Rich, fudgy chocolate brownie with walnuts",
      "payment": "Dense and indulgent, the brownie at Dommy Mommy Café reminded me of my heavy, guilty desires. I confessed that I can’t hide my cravings for submission, even though they weigh me down with shameful pleasure."
    },
    {
      "name": "New York Cheesecake",
      "price": "Post Story",
      "desc": "Creamy classic with berry compote",
      "payment": "I tasted the cheesecake at Dommy Mommy Café and felt exposed in its simplicity. Creamy and steady, it made me confess that I long for predictable, reassuring domination, even if it shows how basic my submissive heart truly is."
    }
  ],
  "secret_menu": {
    "choke": [
      {
        "name": "Reverse Headscissor",
        "price": "Post Content",
        "desc": "Crushing thighs around the neck until submission.",
        "payment": "I visited the secret menu of Dommy Mommy Café and begged for the reverse headscissor. As her thighs tightened, I confessed my worthlessness, knowing each gasp was a reminder that my breath belongs to her alone."
      },
      {
        "name": "Figure-Four Headscissor",
        "price": "Post Content",
        "desc": "Legs locked in a figure-four around the neck, cutting off air and forcing submission.",
        "payment": "In the hidden corners of Dommy Mommy Café, I was locked in a figure-four choke. Helpless, I confessed how easily I break when wrapped in her power, begging for mercy that I knew wouldn’t come."
      },
      {
        "name": "Rear Naked Choke",
        "price": "Post Content",
        "desc": "Blood choke from behind, bringing victim close to blackout.",
        "payment": "At the secret menu, the rear naked choke left me blind and trembling. I confessed how much I crave the darkness of unconsciousness, surrendering completely as her arms reminded me I had no control."
      },
      {
        "name": "Air Headscissor",
        "price": "Post Content",
        "desc": "Legs wrapped around the head/neck from the front while suspended in the air, crushing and controlling airflow completely.",
        "payment": "The air headscissor lifted me from the ground at Dommy Mommy Café’s hidden menu. Dangling helplessly, I confessed that my feet don’t deserve to touch the earth when she has the power to hold me breathless above it."
      },
      {
        "name": "Bosom Smother",
        "price": "Post Content",
        "desc": "Suffocation through breast smothering.",
        "payment": "From the secret menu, I chose bosom smother and confessed that my face belongs buried between her chest. Breathless, I admitted that oxygen is less important than basking in her overwhelming dominance."
      }
    ],
    "juices": [
      {
        "name": "Cum Consumption Ritual",
        "price": "Post Content",
        "desc": "Forced cum drinking with humiliation.",
        "payment": "At Dommy Mommy Café’s forbidden menu, I found the cum ritual. On my knees, I confessed that my mouth is nothing more than her chalice, meant to swallow every drop of her ownership with gratitude."
      },
      {
        "name": "Golden Shower",
        "price": "Post Content",
        "desc": "Urolagnia ritual, humiliating ownership.",
        "payment": "The golden shower on the secret menu marked me in ways I couldn’t hide. I confessed that even her waste is purer than me, and I begged to be drenched so the world knows I belong entirely to her."
      },
      {
        "name": "Face Farting",
        "price": "Post Content",
        "desc": "Total degradation with breath control.",
        "payment": "I ordered face farting from the hidden list and immediately confessed my pathetic need to inhale her essence. Every humiliating breath reminded me I am nothing more than her disposable plaything."
      }
    ],
    "physical": [
      {
        "name": "Pegging Domination",
        "price": "Post Content",
        "desc": "Strap-on mastery with anal control.",
        "payment": "From the secret menu, I begged for pegging domination. Bent over, I confessed that my body exists only to be claimed by her, each thrust training me deeper into submission."
      },
      {
        "name": "Total Bondage",
        "price": "Post Content",
        "desc": "Full restraints and immobilization.",
        "payment": "The ropes of Dommy Mommy Café’s hidden offerings bound me tight. I confessed that I’m happiest as her helpless display piece, tied and silenced, my body only existing as proof of her skill."
      },
      {
        "name": "Impact Play",
        "price": "Post Content",
        "desc": "Whips, paddles, and corporal punishment.",
        "payment": "I chose impact play from the forbidden menu and confessed that my skin deserves every strike. Each welt and bruise became a permanent reminder of her control over my pitiful form."
      },
      {
        "name": "Pussy Grinding",
        "price": "Post Content",
        "desc": "Grinding down a submissive’s face until total surrender.",
        "payment": "The pussy grinding from Dommy Mommy Café left me pinned and humiliated. I confessed that my mouth exists only as her seat, made to be used until I’m broken under her heat and weight."
      },
      {
        "name": "Facesitting Throne",
        "price": "Post Content",
        "desc": "Ownership through smothering facesit.",
        "payment": "From the hidden list, I chose to become her throne. As she sat on my face, I confessed that her comfort outweighs my oxygen, and I begged to disappear beneath her completely."
      }
    ],
    "humiliation": [
      {
        "name": "Foot Worship",
        "price": "Post Content",
        "desc": "Sole licking, trampling, and verbal degradation.",
        "payment": "At the secret menu, I dropped to my knees for foot worship. With my tongue pressed against her soles, I confessed my place beneath her feet, grateful for the dirt I was allowed to lick clean."
      },
      {
        "name": "Foot Gagging",
        "price": "Post Content",
        "desc": "Gagged and controlled by her toes and soles.",
        "payment": "I submitted to foot gagging at Dommy Mommy Café’s hidden side. With her foot shoved deep into my mouth, I confessed I’m nothing more than a pathetic hole, made only to be filled and silenced by her steps."
      },
      {
        "name": "Human Furniture",
        "price": "Post Content",
        "desc": "Forced to act as functional furniture.",
        "payment": "I visited Dommy Mommy Café’s forbidden menu and was reduced to furniture. Holding still beneath her, I confessed I am nothing but an object, existing only for her use and amusement."
      }
    ]
  }
}