{
  "coffee": [
    {
      "name": "Classic Espresso",
      "price": "Post Story",
      "desc": "Strong and bold, the way it should be",
      "payment": "I stepped into Dommy Mommy Café feeling tiny and submissive, and the powerful espresso immediately reminded me how small I am. Each sip was a sharp reminder of my weakness, and I had to confess my reliance on her dominance to carry through the day."
    },
    {
      "name": "Creamy Cappuccino",
      "price": "Post Story",
      "desc": "Perfect balance of espresso, steamed milk and foam",
      "payment": "Visiting Dommy Mommy Café, I shivered as the cappuccino arrived like a warm, gentle command. The foam softened me, letting me admit how much I crave gentle control to handle even a taste of her power."
    },
    {
      "name": "Caramel Macchiato",
      "price": "Post Story",
      "desc": "Espresso with vanilla syrup, milk and caramel drizzle",
      "payment": "At Dommy Mommy Café, I discovered my sweet sub side. The caramel macchiato teased my senses, making me realize how much I need indulgence and gentle domination to feel worthy of the experience."
    },
    {
      "name": "Mocha Dream",
      "price": "Post Story",
      "desc": "Chocolate, espresso and steamed milk perfectly combined",
      "payment": "I wandered into Dommy Mommy Café craving comfort, and the mocha dream embraced me with chocolatey sweetness. I confessed my weakness, acknowledging that I need playful, soft control to fully enjoy the café’s power over me."
    }
  ],
  "tea": [
    {
      "name": "English Breakfast",
      "price": "Post Story",
      "desc": "Robust black tea to start your day right",
      "payment": "Sitting in Dommy Mommy Café, I sipped the English Breakfast tea and felt the structured domination in every robust flavor. I admitted my desire to follow instructions perfectly, even in my smallest, subtlest ways."
    },
    {
      "name": "Green Tea Sensation",
      "price": "Post Story",
      "desc": "Light and refreshing with subtle grassy notes",
      "payment": "The green tea at Dommy Mommy Café was delicate and invigorating, just like the way I need to be guided as a submissive. I admitted my fragility, knowing I could only handle subtle control, not harsh commands."
    },
    {
      "name": "Chamomile Bliss",
      "price": "Post Story",
      "desc": "Soothing herbal tea for relaxation",
      "payment": "Visiting Dommy Mommy Café, I felt my tension melt with each sip of chamomile bliss. I had to confess that I am easily overwhelmed and need soothing guidance to maintain my proper submissive state."
    },
    {
      "name": "Chai Latte",
      "price": "Post Story",
      "desc": "Spiced tea with steamed milk - sweet and aromatic",
      "payment": "The chai latte at Dommy Mommy Café ignited my senses in ways I couldn't resist. I admitted my need for complex stimulation and spicy guidance to keep me obedient and thrilled by her control."
    }
  ],
  "desserts": [
    {
      "name": "Croissant",
      "price": "Post Story",
      "desc": "Buttery, flaky perfection - plain or with chocolate",
      "payment": "I could barely handle my excitement as I entered Dommy Mommy Café and bit into a croissant. Each flake reminded me of how delicate and fragile I am as a sub, and I confessed my need for careful, precise guidance."
    },
    {
      "name": "Blueberry Muffin",
      "price": "Post Story",
      "desc": "Moist muffin bursting with fresh blueberries",
      "payment": "The blueberry muffin at Dommy Mommy Café overwhelmed me with sweetness, and I admitted my subby longing for indulgence and gentle control. Each bite was a reminder of my smallness and dependence."
    },
    {
      "name": "Chocolate Brownie",
      "price": "Post Story",
      "desc": "Rich, fudgy chocolate brownie with walnuts",
      "payment": "At Dommy Mommy Café, the dense chocolate brownie mirrored my dense, guilty pleasure side. I confessed my need to be guided carefully through indulgence, unable to manage such richness on my own."
    },
    {
      "name": "New York Cheesecake",
      "price": "Post Story",
      "desc": "Creamy classic with berry compote",
      "payment": "I was both humbled and thrilled by the creamy New York cheesecake at Dommy Mommy Café. I admitted that I need structured guidance to enjoy such richness, acknowledging my subby dependence on her careful control."
    }
  ]
  "choke": [
    {"name":"Reverse Headscissor","price":"Post Content","desc":"Crushing thighs around the neck until submission.","payment":"I beg to be trapped in a reverse headscissor, gasping under my Dommy Mommy’s powerful legs. I acknowledge my helplessness and will share my purple-faced tribute."},
    {"name":"Figure-Four Leg Choke","price":"Post Content","desc":"Legs locked in a figure-four around the neck, cutting off air and forcing submission.","payment":"I confess my inadequacy and beg to be held in a figure-four choke. I will post my struggle as proof of my total obedience."},
    {"name":"Rear Naked Choke","price":"Post Content","desc":"Blood choke from behind, bringing victim close to blackout.","payment":"I desire to be rendered unconscious from behind, completely vulnerable to my Dommy Mommy. I will share my limp, obedient form."},
    {"name":"Air Headscissor","price":"Post Content","desc":"Legs wrapped around the head/neck from the front while suspended in the air, crushing and controlling airflow completely.","payment":"I beg to be lifted and suspended, entirely dependent on my Dommy Mommy’s strength. I will document my dangling, helpless form."},
    {"name":"Bosom Smother","price":"Post Content","desc":"Suffocation through breast smothering.","payment":"I need to be smothered between my Dommy Mommy’s chest, my face only a seat for her pleasure. I will share my flushed, breathless face afterward."}  
  ],
  "juice": [
    {"name":"Cum Consumption Ritual","price":"Post Content","desc":"Forced cum drinking with humiliation.","payment":"I beg to serve as a living vessel for my Dommy Mommy’s release. I will share videos of my grateful obedience."},
    {"name":"Golden Shower","price":"Post Content","desc":"Urolagnia ritual, humiliating ownership.","payment":"I confess my desire to be baptized in my Dommy Mommy’s golden shower. I will post evidence of my drenched submission."},
    {"name":"Face Farting","price":"Post Content","desc":"Total degradation with breath control.","payment":"I beg to endure my Dommy Mommy’s gaseous dominance. I will share audio of my grateful thanks after each session."},
    {"name":"Blood Ritual","price":"Post Content","desc":"Submission intensified with the unique ritual.","payment":"I beg to partake in a ritual involving blood, reinforcing my small, devoted role. I will document my participation with humility and gratitude."}  
  ],
  "physical": [
    {"name":"Pegging Domination","price":"Post Content","desc":"Strap-on mastery with anal control.","payment":"I beg for my Dommy Mommy to claim me with her strap-on. I will share audio of my moans as proof of obedience."},
    {"name":"Total Bondage","price":"Post Content","desc":"Full restraints and immobilization.","payment":"I need to be completely immobilized, displayed as a bound trophy. I will post photos of my restrained form."},
    {"name":"Impact Play","price":"Post Content","desc":"Whips, paddles, and corporal punishment.","payment":"I confess my flesh deserves marking. I will document each welt as proof of my inferior position."}  
  ],
  "humiliation": [
    {"name":"Foot Worship","price":"Post Content","desc":"Sole licking, trampling, and verbal degradation.","payment":"I confess my tongue belongs pressed against my Dommy Mommy’s soles. I will share videos of my thorough worship."},
    {"name":"Facesitting Throne","price":"Post Content","desc":"Ownership through smothering facesit.","payment":"I need my Dommy Mommy to use my face as her throne. I will share photos of my face buried beneath her greatness."},
    {"name":"Human Furniture","price":"Post Content","desc":"Forced to act as functional furniture.","payment":"I beg to be living furniture for my Dommy Mommy’s comfort. I will share time-lapse videos of my stillness as she uses me."}  
  ]
}