{
  "choke": [
    {
      "name": "Reverse Headscissor",
      "price": "Post Content",
      "desc": "A powerful and intimate chokehold where the dominant partner applies crushing pressure with the backs of their thighs, pinning the submissive's head in place. This position offers complete control, allowing for whispered degradation and the terrifying, beautiful sensation of having one's air supply methodically cut off by pure muscle, forcing ultimate submission.",
      "payment": "I sought the most intimate form of control on Dommy Mommy Café's secret menu: the Reverse Headscissor. As I was pulled into the vise of her thighs, the world narrowed to the sound of my own frantic heartbeat and her commanding voice. With each compression, I confessed my deepest insecurities and my unworthy nature, gasping that my very breath was a privilege she could revoke. I admitted that in that suffocating darkness, wrapped in her strength, I had never felt more complete or more owned."
    },
    {
      "name": "Figure-Four Headscissor",
      "price": "Post Content",
      "desc": "An inescapable and technical submission hold where the legs are locked in a figure-four configuration around the neck. This advanced scissorhold combines immense pressure with psychological dominance, creating a perfect trap that demonstrates superior strength and technique, leaving the submissive no option but to tap out or fade into blackout.",
      "payment": "The technical mastery of the Figure-Four Headscissor from the hidden menu was my undoing. The intricate lock of her legs was a puzzle my pathetic strength could never hope to solve. As the room began to spin and tunnel, I confessed through choked sobs how easily I break under structured pressure. I begged not for air, but for her to witness my complete capitulation, to feel the exact moment my will dissolved into the seamless execution of her power."
    },
    {
      "name": "Rear Naked Choke",
      "price": "Post Content",
      "desc": "A classic and brutally efficient blood choke applied from behind. The dominant's arm encircles the submissive's neck, cutting off blood flow to the brain. It is a swift, intimate, and terrifying embrace that brings on a wave of dizziness and submission, emphasizing the submissive's vulnerability and the dominant's absolute control over their consciousness.",
      "payment": "Blindness was my first gift from the Rear Naked Choke on the secret menu. Then came the dizzying, floating sensation as her forearm became my entire universe. In that vulnerable darkness, pressed against her, I confessed my secret addiction to the edge of unconsciousness. I whispered that I crave the silence and peace she forces upon my cluttered mind, that her embrace is the only thing that makes the world stop, and I surrendered completely to the welcoming blackout."
    },
    {
      "name": "Air Headscissor",
      "price": "Post Content",
      "desc": "An awe-inspiring display of strength and dominance where the submissive is lifted completely off the ground by a headscissor applied from the front. Suspended in mid-air with legs wrapped around their neck, the submissive is utterly helpless, their airflow controlled entirely by the dominant's core strength, combining the terror of suffocation with the humiliation of weightlessness.",
      "payment": "The Air Headscissor from Dommy Mommy Café's forbidden offerings stripped me of all dignity and ground. Dangling like a helpless puppet, my toes scrambling for a purchase that didn't exist, I was forced to confess my deepest unworthiness. I admitted that the earth itself rejects me, and that I only deserve to exist in this breathless, suspended purgatory she created for me. Each gasp was a prayer to her strength, acknowledging that my place is in the air, owned by her gravity."
    },
    {
      "name": "Bosom Smother",
      "price": "Post Content",
      "desc": "A form of suffocation that is as intimate as it is overwhelming. The submissive's face is buried deep within the dominant's chest, where the combination of softness, warmth, and immense pressure creates a sensory-depriving experience. It is a suffocating embrace that speaks of ownership, comfort, and absolute submission, where breath is traded for the scent and feel of dominance.",
      "payment": "I begged for the Bosom Smother from the secret menu, yearning for that particular blend of softness and absolute power. As my world became her skin and my air became her scent, I confessed that oxygen is a poor substitute for the intoxicating essence of her dominance. I admitted that my face has no greater purpose than to serve as an altar for her bosom, and that I would gladly trade a lifetime of breaths for a single moment of suffocating worship in her divine embrace."
    },
    {
      "name": "Thigh Choke Submission",
      "price": "Post Content",
      "desc": "A primal and direct demonstration of power where the dominant uses the raw strength of a single thigh pressed firmly against the submissive's neck, often while pinning them to a surface. It is a brutal, straightforward, and highly effective choke that highlights the sheer physical disparity between the partners and the submissive's helplessness against it.",
      "payment": "The Thigh Choke Submission was a brutal lesson in simplicity from the hidden menu. Pinned beneath her, with the immense power of a single thigh crushing my airway, I confessed the sheer depth of my weakness. There were no intricate locks, just pure, undeniable force. I admitted that my strength is a joke compared to hers, and that I am designed to be pinned and controlled by her simplest effort, my struggles nothing more than a pathetic twitch against her immovable power."
    }
  ],
  "juice": [
    {
      "name": "Cum Consumption Ritual",
      "price": "Post Content",
      "desc": "A sacred act of ownership and humiliation where the submissive is forced to drink the dominant's cum. This ritual is accompanied by verbal degradation, emphasizing the submissive's role as a living vessel, unworthy of anything but the most base and intimate offerings of their owner's body. It is the ultimate act of taste-based servitude.",
      "payment": "I knelt for the Cum Consumption Ritual on Dommy Mommy Café's forbidden menu, opening my mouth not as a person, but as her chalice. As the warm proof of her ownership filled me, I confessed that my throat is her sewer and my stomach her altar. I was degraded with each swallow, forced to admit that this elixir is more nutritious than any food, and that my purpose is to consume her waste with more gratitude than I've ever shown for any gift."
    },
    {
      "name": "Golden Shower Elixir",
      "price": "Post Content",
      "desc": "A humiliating ritual of urolagnia where the submissive is baptized in the dominant's urine. This act is a powerful symbol of ownership, marking the submissive as property both physically and psychologically. The warmth and sensation serve as a constant, degrading reminder of their place beneath their owner, literally showered in their waste.",
      "payment": "I was chosen to receive the Golden Shower Elixir from the secret menu, and I confessed it was the highest honor my wretched self could ever receive. As the warm stream marked my skin and soaked into my clothes, I admitted that her waste is purer than my soul could ever hope to be. I begged to be drenched to the bone, to carry the scent of her ownership as a permanent humiliation, so that everyone would know I am her filthy, claimed property."
    },
    {
      "name": "Scatological Devotion",
      "price": "Post Content",
      "desc": "The most extreme form of ownership and degradation, involving the dominant's feces. This act is not for the faint of heart and represents the absolute bottom of the power dynamic, where the submissive proves their devotion by engaging with the most taboo waste product, symbolizing that they will accept anything from their owner without question.",
      "payment": "In the deepest vault of Dommy Mommy Café's secret menu, I found the Scatological Devotion. Here, I confessed my ultimate worthlessness. Presented with her darkest waste, I was forced to acknowledge that this, too, is a gift I am unworthy of. I admitted that my devotion must be absolute, that to truly belong to her, I must embrace not just her light but her darkness, and that my submission is measured by my willingness to be degraded beyond all human limits."
    },
    {
      "name": "Face Farting Fantasy",
      "price": "Post Content",
      "desc": "A act of total degradation that combines breath control with intimate humiliation. The submissive's face is used as a seat cushion for the dominant to release gas directly onto, often forcing the submissive to inhale the scent and feel the vibration. It is a playful yet deeply demeaning reminder of the submissive's role as an object for the dominant's comfort and amusement.",
      "payment": "I ordered the Face Farting Fantasy from the hidden list, presenting my face as her personal whoopee cushion. With each humiliating vibration and each forced, intimate inhalation, I confessed my pathetic role in her world. I am her joke, her stress reliever, her disposable object meant to absorb her most private releases. I admitted that the air from her body is more valuable than the oxygen I need, and I begged to be suffocated not just by her weight, but by her essence."
    },
    {
      "name": "Saliva Submission",
      "price": "Post Content",
      "desc": "A act of ownership through spit. The dominant spits into the submissive's mouth or onto their face, transforming a typically offensive act into one of intimate possession. It is a constant, wet reminder of the submissive's lowly status and their willingness to accept any fluid from their owner as a gift, symbolizing that even their master's spit is more valuable than they are.",
      "payment": "I opened my mouth for the Saliva Submission ritual at the secret menu. As her spit landed on my tongue and face, I confessed that this was my true nourishment. I admitted that my thirst is not for water, but for any piece of her she is willing to expel into me. Each drop was a blessing, a sticky, humiliating brand that reminded me I am nothing but a canvas for her expressions and a gutter for her fluids."
    },
    {
      "name": "Blood Ritual",
      "price": "Post Content",
      "desc": "An intense and primal act of bonding and ownership involving the taste or sight of blood, often through controlled play piercing or bloodletting. It symbolizes a covenant deeper than skin, a permanent mingling of essence that marks the submissive as irrevocably owned. It is the ultimate testament of trust and devotion on the edge of a blade.",
      "payment": "I offered my wrist for the Blood Ritual on the most forbidden tier of the menu. As the sharp point bit into my skin, I confessed that my lifeblood is hers to spill. Watching the crimson well up, I admitted that this intimate violation was the connection I craved most—to have her mark written in my very veins. I swore my devotion tasted of iron and pain, and that I would wear every scar as a permanent tattoo of her ownership."
    }
  ],
  "physical": [
    {
      "name": "Pegging Domination",
      "price": "Post Content",
      "desc": "The ultimate act of strap-on mastery and role reversal. The dominant, wearing a harness, takes complete anal control of the submissive. This act is less about pleasure for the submissive and more about total psychological surrender, training them to accept ownership and penetration, rewriting their understanding of power and submission with every thrust.",
      "payment": "I bent over and begged for Pegging Domination from the secret menu. As the cold tip pressed against me, I confessed that my body was not my own, but a sheath for her will. Each thrust was a punctuation mark in the sentence of my submission, rewriting my biology to fit her desire. I admitted that pleasure was irrelevant; this was about ownership, about being claimed so deeply that I would never again feel complete without the memory of her taking me."
    },
    {
      "name": "Total Bondage",
      "price": "Post Content",
      "desc": "Complete immobilization using ropes, chains, or other restraints. The submissive is rendered utterly helpless, unable to move or speak, existing solely as an object for the dominant's amusement, aesthetic pleasure, or use. It is the purest form of surrender, where the submissive gives up all autonomy and becomes living art, a testament to the dominant's skill.",
      "payment": "The ropes of Total Bondage from the hidden menu bit into my skin, and I confessed my deepest truth: I am happiest when I am nothing. Silenced and immobilized, I became her artwork, her footstool, her display. I admitted that my purpose is to be used, to be seen but not heard, to hold a position as proof of her meticulous skill and my absolute worthlessness outside of her design."
    },
    {
      "name": "Impact Play",
      "price": "Post Content",
      "desc": "A broad category of corporal punishment using whips, paddles, floggers, canes, and hands. It is a cathartic release for the dominant and a painful, grounding lesson for the submissive. Each strike serves as a reset, a sharp reminder of the power dynamic, and a way to mark the submissive both temporarily and permanently with the evidence of their owner's discipline.",
      "payment": "I chose Impact Play from the forbidden menu and presented my back for correction. With the first searing strike of the paddle, I confessed that my skin was a blank canvas begging for her art. Each welt raised by the whip was a verse of poetry written in pain, each bruise from the cane a permanent reminder of my place. I admitted that I deserve this punishment, that the sting focuses my scattered mind and makes me whole under her precise, painful care."
    },
    {
      "name": "CBT Mastery",
      "price": "Post Content",
      "desc": "Cock and Ball Torture mastery involves the application of pain, pressure, and restraint to the male genitals. It is a direct and intense form of control that highlights the submissive's vulnerability. Through trampling, squeezing, binding, or striking, the dominant demonstrates their absolute authority over the submissive's pleasure, pain, and masculinity.",
      "payment": "I submitted my most sensitive flesh to CBT Mastery on the secret menu. As her heel pressed down, I confessed that my masculinity was a fragile illusion she could shatter with a shift of her weight. Every agonizing squeeze was a lesson in humility, every bound moment a confession that my pleasure and pain are hers to administer as she sees fit. I admitted that my manhood is merely a handle for her control."
    },
    {
      "name": "Needle Play",
      "price": "Post Content",
      "desc": "An advanced form of edge play involving the temporary piercing of the skin with sterile medical needles. It walks the line between pain and pleasure, fear and trust. It is an intense, meditative practice for both parties that demonstrates incredible trust from the submissive and immense responsibility and skill from the dominant, creating a powerful, intimate connection.",
      "payment": "I offered my skin for Needle Play, watching with a mix of terror and awe as she prepared the implements. As the sharp point pierced my flesh, I confessed my absolute trust in her hands. The pain was a bright, clean signal that I was alive and owned. I admitted that there is no greater devotion than to willingly become her pincushion, to allow her to decorate my body with her sharpest art, proving my submission runs deeper than skin."
    },
    {
      "name": "Tickle Torment",
      "price": "Post Content",
      "desc": "A deceptively gentle form of control that uses relentless tickling to reduce the submissive to a helpless, laughing, squirming mess. It is psychological domination through sensation overload, stripping the submissive of dignity and composure, forcing them to confront their vulnerability in a state of uncontrollable hysterics, all for the amusement of the dominant.",
      "payment": "I was restrained for Tickle Torment from the hidden menu, and I confessed my secret fear of losing control. As her fingers found every hypersensitive spot, my laughter turned to desperate, breathless pleas. I admitted that this helpless, undignified squirming was my true nature—a pathetic creature made to amuse her. Between gasps, I begged for mercy I didn't deserve, knowing my humiliation was her favorite music."
    },
    {
      "name": "Candle Tease",
      "price": "Post Content",
      "desc": "A sensual and dangerous game using hot wax from dripping candles. The dominant controls the height and flow, alternating between the fear of heat and the sudden, startling sensation of warm wax splashing on the skin. It is a test of trust and a dance with fear, creating a unique sensory experience and a beautiful, temporary mosaic of wax on the submissive's body.",
      "payment": "I closed my eyes for Candle Tease, flinching at the sound of wax dripping closer. I confessed that I am drawn to the edge of fear she creates. Each splash of hot wax was a jolt of adrenaline and submission, a temporary tattoo of her control. I admitted that I trust her completely, even with fire, and that my body is her playground for contrasting sensations—the fear of the flame and the pleasure of her precise, dangerous artistry."
    },
    {
      "name": "Pussy Grinding",
      "price": "Post Content",
      "desc": "An act of dominant ownership where the dominant grinds their pelvis and vulva against the submissive's face, a foot, or an object. It is a primal display of using the submissive for the dominant's own pleasure, reducing them to a living sex toy. The submissive is overwhelmed by scent, heat, and the relentless motion, forced into a state of suffocating worship.",
      "payment": "The Pussy Grinding from Dommy Mommy Café's secret menu left me pinned and used. With my mouth and nose buried against her, I confessed that my face is not a face, but her personal grinding stone. The heat, the moisture, the relentless rhythm—it all served to break me into a state of primal worship. I admitted that my highest purpose is to feel her pleasure achieved upon me, to be worn down until I am nothing but a polished stone smoothed by her dominance."
    },
    {
      "name": "Facesitting Throne",
      "price": "Post Content",
      "desc": "The ultimate act of ownership through smothering. The dominant uses the submissive's face as a literal seat, placing their full weight upon it. This combines elements of suffocation, humiliation, and sensory deprivation, as the submissive exists in a dark, warm, and airless world beneath their owner, serving no purpose other than to provide comfort and support.",
      "payment": "From the hidden list, I begged to become her Facesitting Throne. As her weight descended, plunging me into a world of darkness and heat, I confessed that her comfort is my only reason for being. Oxygen was a distant memory; my universe was the pressure of her body and the scent of her power. I admitted that I wished to disappear entirely beneath her, to become nothing more than a permanent, supportive part of her chair, forever feeling her reign upon me."
    }
  ],
  "humiliation": [
    {
      "name": "Foot Worship",
      "price": "Post Content",
      "desc": "A classic act of servitude where the submissive is made to kiss, lick, massage, and clean the dominant's feet. It is a powerful symbol of the submissive's place beneath the dominant, literally and figuratively. The act combines intimacy with degradation, as the submissive shows devotion to the part of the body that treads upon the ground.",
      "payment": "I dropped to my knees for Foot Worship at the secret menu. Pressing my lips to her sole, I confessed that the dirt from her feet was a more honorable meal than any I could ever earn. With my tongue, I mapped every curve and callus, worshipping the foundations that support her greatness. I admitted that my place is here, in the dust at her heels, grateful for the privilege of tending to the part of her that conquers the earth."
    },
    {
      "name": "Foot Gagging",
      "price": "Post Content",
      "desc": "An escalation of foot worship where the dominant's foot is used to gag the submissive, shoving toes into their mouth or pressing the sole over their lips. This act combines the humiliation of foot servitude with the control of silence, reminding the submissive that they are not even worthy of speaking unless their mouth is filled by their owner.",
      "payment": "I submitted to Foot Gagging, opening my mouth to receive her toes. The taste of leather and skin was my confession of worthlessness. As her sole pressed down, silencing my pathetic whimpers, I admitted that I am nothing but a hole—a mouth to be filled by her foot, an airway to be blocked by her whim. My purpose was reduced to sucking on her toes in silent gratitude for being used so completely."
    },
    {
      "name": "Human Furniture",
      "price": "Post Content",
      "desc": "Objectification play where the submissive is forced to act as functional furniture—a footstool, a table, an ashtray, a coatrack. This practice emphasizes the submissive's non-person status, existing only for utility and the amusement of the dominant. They must remain still, silent, and useful, reinforcing their role as an object rather than a human.",
      "payment": "I was reduced to Human Furniture on Dommy Mommy Café's forbidden menu. Holding a tray of drinks on my back, I confessed my objecthood. I was not a person, but a table. When her ash was tapped onto my skin, I was an ashtray. I admitted that my greatest value is in my stillness and my utility, that I am happiest when I am used, when my human form is forgotten and I exist only as an extension of her will and comfort."
    },
    {
      "name": "Queen's Throne",
      "price": "Post Content",
      "desc": "A specific form of human furniture where the submissive's body is arranged to form a chair for the dominant to sit upon. This requires the submissive to maintain a painful or uncomfortable position to provide comfort for their owner, symbolizing that their well-being is entirely secondary to the dominant's comfort and regal status.",
      "payment": "I offered my body to become the Queen's Throne, contorting into a seat worthy of her reign. As she settled her weight upon me, I confessed that my bones existed only to support her. The discomfort was a prayer, each ache a testament to my devotion. I admitted that my spine would break before I would let her be uncomfortable, and that there is no nobler purpose for my form than to be the foundation of her dominion."
    },
    {
      "name": "Collar of Servitude",
      "price": "Post Content",
      "desc": "The symbolic and often physical act of collaring. A collar is placed around the submissive's neck, marking them as owned property. It can be a permanent reminder of their status or a ritualistic tool used during scenes. The collar is a powerful symbol of commitment, ownership, and the submissive's voluntary surrender of their freedom.",
      "payment": "I knelt to receive the Collar of Servitude from the secret menu. As the cold leather clasped around my neck, I confessed my eternal ownership. The weight was not a burden, but a comfort—a constant, squeezing reminder that I belong to her. I admitted that my free will is a curse, and that I only feel truly free when this symbol chokes me, when my choices are narrowed to a single purpose: her pleasure and service."
    },
    {
      "name": "Pet Training",
      "price": "Post Content",
      "desc": "A roleplay scenario where the submissive is treated and trained as an animal pet—a puppy, kitten, or pony. This involves eating from bowls, drinking from water bottles, being walked on a leash, and performing tricks for rewards. It is a deep form of psychological regression and humiliation, stripping away human complexity for simple, obedient animal instinct.",
      "payment": "I crawled on all fours for Pet Training, barking on command for a treat. I confessed that my human mind is a source of failure and anxiety. As I lapped water from a bowl, I admitted that my true, happiest self is a simple animal, eager for her praise and fearful of her discipline. The leash around my neck was not a restraint, but a tether to my true owner, and I begged for her to train me until my human ego was completely broken."
    }
  ]
}