{
  "choke": [
    {
      "name": "Reverse Headscissor",
      "price": "Post Content",
      "desc": "Crushing thighs around the neck until submission.",
      "payment": "I visited the secret menu of Dommy Mommy Café and begged for the reverse headscissor. As her thighs tightened, I confessed my worthlessness, knowing each gasp was a reminder that my breath belongs to her alone."
    },
    {
      "name": "Figure-Four Headscissor",
      "price": "Post Content",
      "desc": "Legs locked in a figure-four around the neck, cutting off air and forcing submission.",
      "payment": "In the hidden corners of Dommy Mommy Café, I was locked in a figure-four choke. Helpless, I confessed how easily I break when wrapped in her power, begging for mercy that I knew wouldn’t come."
    },
    {
      "name": "Rear Naked Choke",
      "price": "Post Content",
      "desc": "Blood choke from behind, bringing victim close to blackout.",
      "payment": "At the secret menu, the rear naked choke left me blind and trembling. I confessed how much I crave the darkness of unconsciousness, surrendering completely as her arms reminded me I had no control."
    },
    {
      "name": "Air Headscissor",
      "price": "Post Content",
      "desc": "Legs wrapped around the head/neck from the front while suspended in the air, crushing and controlling airflow completely.",
      "payment": "The air headscissor lifted me from the ground at Dommy Mommy Café’s hidden menu. Dangling helplessly, I confessed that my feet don’t deserve to touch the earth when she has the power to hold me breathless above it."
    },
    {
      "name": "Bosom Smother",
      "price": "Post Content",
      "desc": "Suffocation through breast smothering.",
      "payment": "From the secret menu, I chose bosom smother and confessed that my face belongs buried between her chest. Breathless, I admitted that oxygen is less important than basking in her overwhelming dominance."
    }
  ],
  "juices": [
    {
      "name": "Cum Consumption Ritual",
      "price": "Post Content",
      "desc": "Forced cum drinking with humiliation.",
      "payment": "At Dommy Mommy Café’s forbidden menu, I found the cum ritual. On my knees, I confessed that my mouth is nothing more than her chalice, meant to swallow every drop of her ownership with gratitude."
    },
    {
      "name": "Golden Shower",
      "price": "Post Content",
      "desc": "Urolagnia ritual, humiliating ownership.",
      "payment": "The golden shower on the secret menu marked me in ways I couldn’t hide. I confessed that even her waste is purer than me, and I begged to be drenched so the world knows I belong entirely to her."
    },
    {
      "name": "Face Farting",
      "price": "Post Content",
      "desc": "Total degradation with breath control.",
      "payment": "I ordered face farting from the hidden list and immediately confessed my pathetic need to inhale her essence. Every humiliating breath reminded me I am nothing more than her disposable plaything."
    }
  ],
  "physical": [
    {
      "name": "Pegging Domination",
      "price": "Post Content",
      "desc": "Strap-on mastery with anal control.",
      "payment": "From the secret menu, I begged for pegging domination. Bent over, I confessed that my body exists only to be claimed by her, each thrust training me deeper into submission."
    },
    {
      "name": "Total Bondage",
      "price": "Post Content",
      "desc": "Full restraints and immobilization.",
      "payment": "The ropes of Dommy Mommy Café’s hidden offerings bound me tight. I confessed that I’m happiest as her helpless display piece, tied and silenced, my body only existing as proof of her skill."
    },
    {
      "name": "Impact Play",
      "price": "Post Content",
      "desc": "Whips, paddles, and corporal punishment.",
      "payment": "I chose impact play from the forbidden menu and confessed that my skin deserves every strike. Each welt and bruise became a permanent reminder of her control over my pitiful form."
    },
    {
      "name": "Pussy Grinding",
      "price": "Post Content",
      "desc": "Grinding down a submissive’s face until total surrender.",
      "payment": "The pussy grinding from Dommy Mommy Café left me pinned and humiliated. I confessed that my mouth exists only as her seat, made to be used until I’m broken under her heat and weight."
    },
    {
      "name": "Facesitting Throne",
      "price": "Post Content",
      "desc": "Ownership through smothering facesit.",
      "payment": "From the hidden list, I chose to become her throne. As she sat on my face, I confessed that her comfort outweighs my oxygen, and I begged to disappear beneath her completely."
    }
  ],
  "humiliation": [
    {
      "name": "Foot Worship",
      "price": "Post Content",
      "desc": "Sole licking, trampling, and verbal degradation.",
      "payment": "At the secret menu, I dropped to my knees for foot worship. With my tongue pressed against her soles, I confessed my place beneath her feet, grateful for the dirt I was allowed to lick clean."
    },
    {
      "name": "Foot Gagging",
      "price": "Post Content",
      "desc": "Gagged and controlled by her toes and soles.",
      "payment": "I submitted to foot gagging at Dommy Mommy Café’s hidden side. With her foot shoved deep into my mouth, I confessed I’m nothing more than a pathetic hole, made only to be filled and silenced by her steps."
    },
    {
      "name": "Human Furniture",
      "price": "Post Content",
      "desc": "Forced to act as functional furniture.",
      "payment": "I visited Dommy Mommy Café’s forbidden menu and was reduced to furniture. Holding still beneath her, I confessed I am nothing but an object, existing only for her use and amusement."
    }
  ]
}